/************************************************/
/*                                              */
/*   三维画生成程序，我的个人主页               */
/*   http://www.liuhs.com                       */
/*   中的三维画不是用此程序生成，但原理一样     */
/*   此程序用 Turbo C 2.00 调试通过             */
/*                                              */
/*                             刘红石           */
/************************************************/

# include <stdlib.h>
# include <graphics.h>
# include <conio.h>
# include <alloc.h>
# include <stdio.h>
# include <time.h>

# define W    80       /* 重复的图案宽度 , displace distance */
# define MAXX 639   /* 三维画最大宽度 */
# define MAXY 479   /* 三维画最大高度 */
# define MAXZ 10    /* 三维形象最大层数,layers */
# define S    20    /* scale factor */

int _x[MAXX+1];
char *hf[]={
     "00000001000000000000000000000000",
     "00000000200000000000000000000000",
     "00000003000000000000000000000000",
     "11117777777711111177777777711111",
     "11117777777771111177111111771111",
     "11111111117771111177111111771111",
     "11111111117771111177111111771111",
     "11117777777771111177111111771111",
     "11111111117771111177111111771111",
     "11111111117771111177111111771111",
     "11117777777771111177111111771111",
     "11117777777711111177777777711111",
     "11111111111111111111111111111111",
     "11111111111111111111111111111111",
     "11112233445566776655443322111111",
     "11112233445566776655443322111111",
     "11111111111111111111111111111111",
     "11111111111111111111111111111111",
     "11112223344456665443322211111111",
     "11112223344456665443322211111111",
     "10101010101010101010101010101010",
     "01010101010101010101010101010101",
     "10101010101010101010101010101010",
     "01010101010101010101010101010101"};

void main()
{
  int gd=0,gm;
  int i,j,d;
  int x,y,h;
  int mx,my;
  int *p;

  initgraph(&gd,&gm,"");         /* 初始化图形设备 */
  randomize();
  for(i=1;i<=30000;i++){
    setcolor(i % 8+7);
    x=random(MAXX); y=random(MAXY);
    line(x,y,x+random(7),y+random(7));
  }
  getch();

  p=(int*)malloc(imagesize(0,0,S-1,1));  /* 分配内存，准备存放图块数据 */
  for(y=0;y<= MAXY;y+=S){               /* 一行一行进行 */
        for(x=0;x<MAXX;x++)             /* 初始化 */
           _x[x]=x;
	for(h=0;h<=MAXZ;h++){          /* 从1层到mskZ层，逐层处理 */
	   d=W-h;
           for(x=0;x<MAXX;x++){
		  if (hf[y/S][x/S]-48==h )
                       _x[x+d] = x;
           }
 	}

	for(x=0;x<=MAXX;x++){
		if(_x[x] != x){
		  getimage(_x[x],y,_x[x],y+S-1,p);
		  putimage(x,y,p,0);
		}
	}
  }

  getch();             /* 等待按键 */
  closegraph();        /* 关闭图形设备 */
}